<template>
  <div class="basepage homepage">
    <div class="news">
      <Swiper
          :modules="modules"
          :slides-per-view="1"
          :breakpoints="{ 1280: { enabled: false } }"
          navigation
          space-between="10"
          loop
          v-if="news.length"
      >
        <SwiperSlide v-for="item in news" :key="item.id">
          <NewsItem :item="item"/>
        </SwiperSlide>
      </Swiper>
    </div>
    <TheCalendar/>
    <SliderGallery/>
    <IndexBirthdaysCard/>
    <IndexDefaultCard
        v-for="item in defaultCards"
        :key="item.title"
        :title="item.title"
        :text="item.text"
        :background="item.background"
        :link="item.link"
        :component="item.component"
    />
  </div>
</template>

<script setup>
import NewsItem from "@/components/NewsItem.vue";
import TheCalendar from "@/components/TheCalendar.vue";
import SliderGallery from "@/components/SliderGallery.vue";
import IndexDefaultCard from "@/components/IndexDefaultCard.vue";
import IndexBirthdaysCard from "@/components/IndexBirthdaysCard.vue";
import IconMarketingDocs from "@/components/icons/IconMarketingDocs.vue";
import IconUpdates from "@/components/icons/IconUpdates.vue";
import IconOrders from "@/components/icons/IconOrders.vue";
import {NEWS_URL} from "@/constants";

import 'swiper/css';
import 'swiper/css/navigation';

import {onMounted, ref} from "vue";
import axios from "axios";
import {Navigation} from 'swiper';
import {Swiper, SwiperSlide} from 'swiper/vue';

const defaultCards = ref([
  {
    title: "Маркетинговые документы",
    text: "Задокументируй невербальные всполохи бездны в сознании, расщепись на атомы и созерцай незримое.",
    background: '#F2CECE',
    link: "/marketing-docs",
    component: "IconMarketingDocs"
  },
  {
    title: "Обновления на сайте",
    text: "Задокументируй невербальные всполохи бездны в сознании, расщепись на атомы и созерцай незримое.",
    background: '#E3BBF7',
    link: "/updates",
    component: "IconUpdates"
  },
  {
    title: "Оформить заявку",
    text: "Задокументируй невербальные всполохи бездны в сознании, расщепись на атомы и созерцай незримое.",
    background: '#BAF7F3',
    link: "/orders",
    component: "IconOrders"
  },
]);
const news = ref([
  {
    "id": 16,
    "title": "В компании юбиляр: поздравляем Жанну Петровну!",
    "author_id": 1,
    "category_id": 2,
    "is_published": 1,
    "url": "gw45h5w4hg",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 12,
    "like_count": 20,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [1, 1, 1, 1, 1, 1, 1],
    "category": {
      "id": 2,
      "title": "Юбиляры"
    }
  },
  {
    "id": 30,
    "title": "Детский Новый год в новом формате",
    "author_id": 1,
    "category_id": 2,
    "is_published": 1,
    "url": "the-ex543h45",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 2,
    "like_count": 0,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 2,
      "title": "Юбиляры"
    }
  },
  {
    "id": 29,
    "title": "В компании юбиляр: поздравляем Жанну Петровну!",
    "author_id": 1,
    "category_id": 5,
    "is_published": 1,
    "url": "the-e43h45635",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 2,
    "like_count": 0,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 5,
      "title": "Человек года"
    }
  },
  {
    "id": 28,
    "title": "Детский Новый год в новом формате",
    "author_id": 1,
    "category_id": 2,
    "is_published": 1,
    "url": "the-ex543h456",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 2,
    "like_count": 0,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 2,
      "title": "Юбиляры"
    }
  },
  {
    "id": 27,
    "title": "Детский Новый год в новом формате",
    "author_id": 1,
    "category_id": 3,
    "is_published": 1,
    "url": "the-ex54",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 2,
    "like_count": 0,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 3,
      "title": "Выставка"
    }
  },
  {
    "id": 26,
    "title": "В компании юбиляр: поздравляем Ксению Попову! ",
    "author_id": 1,
    "category_id": 2,
    "is_published": 1,
    "url": "the-ex543h45635aef",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 22,
    "like_count": 10,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 2,
      "title": "Юбиляры"
    }
  },
]);
const modules = [Navigation];

// axios.get(NEWS_URL).then(response => {news.value = response.data.data});
</script>

<style>
.homepage {
  display: grid;
  position: relative;
  z-index: 0;
  row-gap: 20px;

  @media (min-width: 1280px) {
    grid-template-columns: repeat(3, minmax(0, 1fr));
    grid-template-rows: repeat(3, minmax(0, 1fr));
    gap: 16px;
    height: 100vh;
    min-height: 720px;
  }

  @media (min-width: 1920px) {
    gap: 20px;
  }
}

.news {
  overflow: hidden;
  @media (min-width: 1280px) {
    display: grid;
    grid-row-start: 1;
    grid-row-end: 4;
  }
}

.news .swiper {
  padding-bottom: 2px;
}

.news .swiper-wrapper {
  @media (min-width: 1280px) {
    display: flex;
    flex-direction: column;
    row-gap: 16px;
    overflow-y: scroll;
  }

  @media (min-width: 1920px) {
    row-gap: 20px;
    padding: 0 1px;
  }
}

.news .swiper {
  width: 100%;
}

.news .swiper-slide {
  @media (min-width: 1280px) {
    height: auto;
  }
}
</style>