<template>
  <div class="basepage newspage">
    <h1 class="title">Новости</h1>
    <div class="news-categories shadow rounded">
      <a to="/news" class="news-category rounded active">Все</a>
      <a v-for="category in categories" :key="category" :to="`/news/${category}`"
                   class="news-category rounded">
        {{ category }}
      </a>
    </div>
    <div class="news-list" v-if="news.length">
      <NewsItem v-for="item in news" :key="item.id" :item="item"/>
    </div>
  </div>
</template>

<script setup>
import NewsItem from "@/components/NewsItem.vue";
import {ref} from "vue";
import axios from "axios";
import {NEWS_URL} from "@/constants";

const news = ref([
  {
    "id": 16,
    "title": "В компании юбиляр: поздравляем Жанну Петровну!",
    "author_id": 1,
    "category_id": 2,
    "is_published": 1,
    "url": "gw45h5w4hg",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 12,
    "like_count": 20,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [1, 1, 1, 1, 1, 1, 1],
    "category": {
      "id": 2,
      "title": "Юбиляры"
    }
  },
  {
    "id": 30,
    "title": "Детский Новый год в новом формате",
    "author_id": 1,
    "category_id": 2,
    "is_published": 1,
    "url": "the-ex543h45",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 2,
    "like_count": 0,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 2,
      "title": "Юбиляры"
    }
  },
  {
    "id": 29,
    "title": "В компании юбиляр: поздравляем Жанну Петровну!",
    "author_id": 1,
    "category_id": 5,
    "is_published": 1,
    "url": "the-e43h45635",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 2,
    "like_count": 0,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 5,
      "title": "Человек года"
    }
  },
  {
    "id": 28,
    "title": "Детский Новый год в новом формате",
    "author_id": 1,
    "category_id": 2,
    "is_published": 1,
    "url": "the-ex543h456",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 2,
    "like_count": 0,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 2,
      "title": "Юбиляры"
    }
  },
  {
    "id": 27,
    "title": "Детский Новый год в новом формате",
    "author_id": 1,
    "category_id": 3,
    "is_published": 1,
    "url": "the-ex54",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 2,
    "like_count": 0,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 3,
      "title": "Выставка"
    }
  },
  {
    "id": 26,
    "title": "В компании юбиляр: поздравляем Ксению Попову! ",
    "author_id": 1,
    "category_id": 2,
    "is_published": 1,
    "url": "the-ex543h45635aef",
    "description": "Выставка Аналитика всегда считалась мероприятием для продвижения продукции компании БиоСистемы",
    "content": "В этом году впервые за нашу историю в выставке Аналитика принял участие и БиоЛайн — а именно отдел оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях. У ребят был подиум с двумя приборами — спектрофотометром LTek и счетчиком клеток NanoEnTek. К оборудованию отдела был проявлен неплохой интерес, особенно со стороны представителей фармпроизводств. Продукция компании БиоСистемы традиционно пользовалась большой популярностью, коллеги не успевали закончить с одними гостями, как подходили другие, образовывалась целая толпа слушателей, а визитки и вовсе разлетелись за первые два дня выставки.\r\n<p>\r\n</p>\r\nНа следующий год мы забронировали большой стенд, почти 100 кв.м., на котором хватит места для того, чтобы разместить широкую и габаритную линейку продукции БиоСистем, а также новое оборудование отдела оптической микроскопии, анализа изображений и спектрометрии в научных исследованиях, которое к тому моменту будет зарегистрировано в России.",
    "preview_image": "index-news-img",
    "show_count": 22,
    "like_count": 10,
    "published_date": "2023-05-25",
    "unpublished_date": null,
    "created_at": "2023-05-25T14:35:27.000000Z",
    "updated_at": "2023-05-25T12:54:24.000000Z",
    "comments": [],
    "category": {
      "id": 2,
      "title": "Юбиляры"
    }
  },
]);
const categories = ref([
  'Polytics',
  'Sport',
  'Culture']);

// axios
//     .get(NEWS_URL)
//     .then(response => {
//       news.value = response.data.data;
//     })
</script>

<style scoped>
.title {
  margin-bottom: 35px;
}

.news-categories {
  margin-bottom: 20px;
  background-color: var(--white);
  display: flex;
  width: fit-content;
}

.news-category {
  display: flex;
  color: var(--blue-dark);
  font-weight: 500;
  font-size: 13px;
  padding: 10px 28px;
}

.news-category.active {
  background-color: var(--blue-light);
  position: relative;
  z-index: 1;
}

.news-category.active::after {
  display: none;
}

.news-category:nth-child(n + 2)::after {
  content: '';
  position: absolute;
  background-color: var(--gray-dark);
  opacity: 0.4;
  top: 0;
  bottom: 0;
  left: -1px;
  margin: auto;
  width: 1px;
  height: 12px;
  -webkit-border-radius: 30px;
  -moz-border-radius: 30px;
  border-radius: 30px;
}

.news-list {
  display: grid;
  position: relative;
  z-index: 0;
  row-gap: 20px;

  @media (min-width: 1280px) {
    grid-template-columns: repeat(3, minmax(0, 1fr));
    grid-auto-flow: row;
    gap: 16px;
  }

  @media (min-width: 1920px) {
    gap: 20px;
  }
}

.title {
  text-align: center;
  font-weight: 700;
  color: var(--blue-dark);
}
</style>